{
  "Courses": [
    {
      "Subject": "MATH",
      "CourseCode": "0001",
      "CourseName": "Cambridge International AS & A Level Mathematics",
      "SyllabusContent": "Cambridge International A Level Mathematics develops a set of transferable skills. These include the skill of working with mathematical information, as well as the ability to think logically and independently, consider accuracy, model situations mathematically, analyse results and reflect on findings.\n\nLearners can apply these skills across a wide range of subjects and these skills equip them well for progression to higher education or directly into employment.\n\nAt AS level, teachers can choose from three different routes to Cambridge International AS Level Mathematics: Pure Mathematics only, Pure Mathematics and Mechanics, or Pure Mathematics and Probability & Statistics.\n\nAt A Level, teachers can also choose from different routes to Cambridge International A Level Mathematics depending on the choice of applied mathematics (Mechanics and/or Probability and Statistics).\n\nPlease note: From 2020 Cambridge International A Level Mathematics has two different routes: Pure Mathematics and Probability & Statistics only; or Pure Mathematics, Mechanics and Probability & Statistics.",
      "id": "3155"
    },
    {
      "Subject": "SOC",
      "CourseCode": "0230",
      "CourseName": "Classical Sociological Theory",
      "SyllabusContent": "Theory is not only the bedrock of sociological thinking and analysis but is also a critical way by which we can make sense of our social world. These theories act as historically situated, analytical frameworks used by sociologists to study, interpret, and explain social phenomena such as events, systems, relationships, behaviors, or dynamics in society. They can also serve as roadmaps for action based on these interpretations and re-imaginings of society that influence politics, policy, culture, and collective thought. Theory, in other words, plays an important shaping influence for our experiences and the world we live in.\n\nEarly sociologists wrote about the changing contours of modern society–from shifts in division of labor to the rise of new institutions, identities, and forms of domination–in response to industrialization, the emergence of global capitalism, and encounters through colonial-imperial conquest. In this course, we will be exploring work by some of the key classical sociological theorists of the nineteenth and early- twentieth century, including the “Big Three”–Marx, Weber, and Durkheim–considered to be the “founding fathers” of Sociology. \n\nWe will also look at other theorists included in the canon (such as Cooley, Mead, Simmel) as well as some additional important contemporaries and critical theorists (including Goffman and Gramsci). And we will consider some of the core questions that early sociological thinkers and theorists sought to address: What is the relationship between self and society, structure and agency or culture, wealth, and power? To what extent, and in what ways, are our experiences constrained or enabled by our social world? And, related to this, what are some approaches to radically reimagining society in revolutionary new ways? All important questions that remain relevant today! To that end, we will be expressly thinking about how these theories can be applied to better understanding current society as well as our own lives and experiences. \n\nThat said, as much value as the classical canon offers for thinking about the past and present, another part of our work together will be to critically revisit what gets defined as classical sociology–which might just as easily be thought of as the theories of “old, dead white men.” Moreover, these classical theories were necessarily informed by the positionality and socio-historical context of the thinkers themselves and often reflected–or even contributed to–dominant colonial, white supremacist, heteropatriarchal worldviews. \n\nFor this reason, we will be reading more recent works by theorists who name this issue (Connell, de Sousa Santos, among others) and help us to interrogate the canon and its reverberating legacies in the Academy and beyond. In addition, we will explore how early feminist critics and theorists of color (Du Bois, Khabdul, Apess, Gilman, Cooper, Weber, and Wells) enrich and problematize the historical origins of Sociology. Or as Raewyn Connell puts it, we will ask, “what makes classical sociology classical”?  \n\nFurthermore, as a theory-based and writing intensive course, this class will not only give you a firm grounding in sociological theory but will provide you with the opportunity to develop your own analytical toolkits and skills as a self-reflexive, critical thinker and writer. Anticipate writing workshops, weekly informal reading responses, formal theoretical essays, free writes, peer reviews and collaborative assignments, personal reflection, large and small group discussion, and one-on-one work with me as we collectively work towards learning what there is to love about theory and effective ways to engage with, evaluate, apply, and communicate about it. And finally, returning to the connection between theory and action, we will explicitly consider how these theories can be applied in ways to inform social action on a contemporary issue for the term paper. ",
      "id": "148b"
    }
  ],
  "info": {
    "Info": "to simulate an API from this db.json, type the following commande in the terminal window: npx json-server --watch db.json --port 8000"
  }
}